const station = 
{
    'Московская линия': [
        [
            'Уручье', 
            'Станция мелкого заложения, колонная. 2 выхода. Открыта 7 ноября 2007 года', 
            ''
        ],
        [
            'Борисовский тракт',
            'Станция мелкого заложения, колонная. 1 выход. Открыта 7 ноября 2007 года. Выход к 15-ому корпусу БНТУ',
            ''
        ],
        [
            'Восток', 
            'Станция мелкого заложения, односводчатая. 2 выхода. Открыта 30 декабря 1986 года. Выход к Национальной библиотеке, к микрорайону "Восток", к лесопарку "Зеленый Луг"', 
            ''
        ],
        [
            'Московская', 
            'Станция мелкого заложения, колонная. 2 выхода. Открыта 29 июня 1984 года. Выход к Детской железной дороге имени Заслонова, к аграрно-техническому университету, к киностудии "Беларусьфильм", к автовокзалу "Московский"', 
            ''
        ],
        [
            'Парк Челюскинцев', 
            'Станция мелкого заложения, односводчатая. 2 выхода. Открыта 29 июня 1984 года. Выход к Детской железной дороге имени Заслонова, к Ботаническому Саду, к парку Челюскинцев.',
            ''
        ],
        [
            'Академия Наук', 
            'Станция мелкого заложения, колонная. 2 выхода. Открыта 29 июня 1984 года. Выход к Академии наук, кинотеатру "Октябрь", главному корпусу БНТУ, к Дворцу водного спорта, к Литературному музею Якуба Коласа, к Ботаническому Саду. ', 
            ''
        ],
        [
            'Площадь Якуба Коласа', 
            'Станция мелкого заложения, колонная. 2 выхода. Открыта 29 июня 1984 года. Выход на площадь Якуба Коласа, к Белорусской государственной филармонии, к Комаровскому рынку, к Академии физкультуры и спорта, к ЦУМу', 
            ''
        ],
        [
            'Площадь Победы', 
            'Станция мелкого заложения, колонная. 2 выхода. Открыта 29 июня 1984 года. На станции действует экскалатор. Выход на площадь Победы, к памятнику Победы и Вечному Огню, к Дворцу Искусств, к кинотеатру "Мир", к дому-музею I съезда РСДРП. ', 
            ''
        ],
        [
            'Октябрьская', 
            'Станция мелкого заложения, колонная. Переход на станцию Купаловская Автозаводской линии. 2 выхода. Открыта 29 июня 1984 года. На станции работает экскалатоор. Выход на на Октябрьскую площадь, к Дворцу Профсоюзов, к Дворцу Республики, к музею истории Великой Отечественной войны, к резиденции Президента РБ, ГУМу, к кинотеатру "Пионер", кукольному театру, театрам юного зрителя и имени Янки Купалы.', 
            'Переход на станцию Купаловская Автозаводской линии'],
        [
            'Площадь Ленина', 
            'Станция мелкого заложения, односводчатая. 2 выхода. Открыта 29 июня 1984 года. Выход к Центральному железнодорожному вокзалу, главному корпусу Белорусского Государстенного Университета', 
            'Переход на станцию Вокзальная линии Зеленый луг'
        ],
        [
            'Институт Культуры', 
            'Станция мелкого заложения, односводчатая. 2 выхода. Открыта 29 июня 1984 года. Выход к электропоездам оршанского направления на о. п. Институт культуры, Академии Управления при Президенте РБ, к Белорусскому университету культуры', 
            ''
        ],
        [
            'Грушевка', 
            '',
            ''
        ],
        [
            'Михалово', 
            '',
            ''
        ],
        [
            'Петровщина', 
            '',
            ''
        ],
        [
            'Малиновка',
             '',
             ''
            ],
    ],

    'Автозаводская линия': [
        [
            'Каменная горка',
            'Станция мелкого заложения, колонная. 2 выхода. Открыта 7 ноября 2005 года. Выход к микрорайонам "Красный Бор" и "Кунцевщина"',
            ''
            ],
        [
            'Кунцевщина',
            'Станция мелкого заложения, колонная. 2 выхода. Открыта 7 ноября 2005 года. ',
            ''
            ],
        [
            'Спортивная',
            'Станция мелкого заложения, колонная. 1 выход. Открыта 7 ноября 2005 года. На станции имеется лифт для людей с ограниченными возможностями. Выход к Ледовому дворцу спорта.',
            ''
            ],
        [
            'Пушкинская',
            'Станция мелкого заложения, колонная. 2 выхода. Открыта 3 июля 1995 года. Выход к гостинице "Орбита" и кинотеатру "Аврора". ',
            ''
            ],
        [
            'Молодежная',
            'Станция мелкого заложения, односводчатая. 1 выход(выход 2 законсервирован, до открытия о. п. электропоездов Молодеченского направления). Открыта 3 июля 1995 года. ',
            ''
            ],
        [
            'Фрунзенская',
            'Станция мелкого заложения, односводчатая. 2 выхода. Открыта 31 декабря 1990 года. На станции работает экскалатор. на Юбилейную площадь, к кинотеатру "Беларусь". ',
            'Переход на станцию Юбилейная площадь линии Зеленый луг'
            ],
        [
            'Немига',
            'Станция мелкого заложения, односводчатая. 2 выхода. Открыта 31 декабря 1990 года. Выход ко Дворцу спорта, Троицкому предместью. ',
            ''
            ],
        [
            'Купаловская',
            'Станция мелкого заложения, односводчатая. 2 выхода. Переход на станцию Октябрьская Московской линии. Открыта 31 декабря 1990 года. На станции действует экскалатор. Выход к Октябрьской площадь, резиденции Президента РБ, к музею ВОВ',
            'Переход на станцию Октябрьская Московской линии'
            ],
        [
            'Первомайская',
            'Станция мелкого заложения, колонная. Единственная станция Минского метрополитена с выходом на правую сторону. 2 выхода. Открыта в 1991 году. Выход к набережной Свислочи, к стадиону "Динамо", к концертному залу "Минск", к лицею БГУ, к заводу "Кристалл" и заводу имени Октябрьской Революции. ',
            ''
             ],
        [
            'Пролетарская',
            'Станция мелкого заложения, колонная. 1 выход. Открыта 31 декабря 1990 года. Выход к электропоездам на станцию Минск-Восточный',
            ''
            ],
        [
            'Тракторный завод',
            'Станция мелкого заложения, односводчатая. 2 выхода. Открыта 31 декабря 1990 года. Выход к республиканскому предприятию "Минский тракторный завод", к Дворцу культуры тракторного завода.',
             ''
            ],
        [
            'Партизанская',
            'Станция мелкого заложения, односводчатая. 2 выхода. Открыта 31 декабря 1990 года. Выход к республиканскому предприятию "Минский тракторный завод", к Дворцу культуры тракторного завода.',
             ''
            ],
        [
            'Автозаводская',
            'Станция мелкого заложения, колонная. 2 выхода. Открыта 7 ноября 1997 года. Выход к Дворцу культуры МАЗа, к Минскому институту управления',
             ''
            ],
        [
            'Могилевская',
            'Станция мелкого заложения, колонная. 2 выхода. Открыта 5 сентября 2001 года.На станции работает лифт.',
            ''
        ],
        
    ],
    'Зелёный луг': [
        [
            'Юбилейная площадь',
            '',
            'Переход на станцию Фрунзенская Автозаводскай линии'
        ],
        [
            'Площадь франтишка богушевича',
            '',
            ''
        ],
        [
            'Вокзальная',
            '',
            'Переход на станцию Площадь Ленина Московской линии'
        ],
        [
            'Ковальская Слобода',
            '',
            ''
        ],
        [
            'Аэродромная',
            '',
            ''
        ],
        [
            'Неморшанский парк',
            '',
            ''
        ],
        [
            'Слуцкий Гостинец',
            '',
            ''
        ],
    ], 

};
let inp     = document.querySelector('.stationInp');
let outStat = document.querySelector('.outStat');
let outDesc = document.querySelector('.outDesc');
let outNew  = document.querySelector('.outNew');
let outErr  = document.querySelector('.outErr');

document.querySelector('.stationBut').onclick = function(){
    let val        = inp.value;

    let newVal     = '';
    let AllStation = '';

    outStat.innerHTML = '';
    outDesc.innerHTML = '';
    outErr.innerHTML  = '';

    if( val.length > 3 ){
        newVal = val[0].toUpperCase() +val.slice(1);
        console.log(newVal)
        for (const key in station) {
            for( let i = 0; i < station[key].length;i++ )
            {
            if(key == newVal)
            {
                AllStation += station[key][i][0] + ',<br>';
                outStat.innerHTML = `В  ${key} ${station[key].length} станции: <br>${AllStation}.`
                
            }
            else{
                    if( station[key][i][0] == newVal )
                    {
                        outStat.innerHTML = `Станция ${newVal} находится на: ${key}`
                        if( station[key][i][1] != '' )
                        {
                            outDesc.innerHTML = `Известно что: ${station[key][i][1]}`
                        }
                        if( station[key][i][2] != '' )
                        {
                            outNew.innerHTML = `Есть ${station[key][i][2]}`
                        }
                    }
                }
            }
        }
    }
    inp.value = '';
}

setInterval(function(){
    let empty = '';
    let val = inp.value;
    var outHelp = '';
    let newVal = '';
    if( val.length > 0 ) // проверка
    {
        newVal = val[0].toUpperCase() +val.slice(1);
    for( let key in station)
    {
        for(let i = 0; i < station[key].length; i++)
        {
            // for( let k = 0; k < station[key][i][0].length; k++ )
            // {
                let ser = station[key][i][0].split('').slice(0,val.length).join('');
                if( ser == newVal )
                {
                    empty += `<div class='out stat'>${station[key][i][0]}</div><br>`;
                    outHelp = document.querySelector('.stat');
                }
                // }
            }
        }
    }
        
        outErr.innerHTML = `${empty} `


    // if чтоб не было ошибок
    if( outHelp != '' )
    {
        let outHelpAll = document.querySelectorAll('.stat');
        for( let k = 0; k < outHelpAll.length; k++ ){
            console.log(outHelpAll[k])
            // При нажатии на подсказку
            outHelpAll[k].onclick = function(){
                inp.value = this.textContent;
                document.querySelector('.stationBut').click();
            }
        }

    }
}, 3000);
    
